Revit 2027 API
AnalyticalModelSelector(AnalyticalCurveSelector) Constructor
 Creates a selector for the analytical model geometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalModelSelector(
	AnalyticalCurveSelector inCurveSelector
)
Public Sub New (
	inCurveSelector As AnalyticalCurveSelector
)
public:
AnalyticalModelSelector(
	AnalyticalCurveSelector inCurveSelector
)
new :
        inCurveSelector : AnalyticalCurveSelector -> AnalyticalModelSelector
Parameters
inCurveSelector AnalyticalCurveSelector
 Portion of the analytical curve in which the client has interest.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This version is useful for single-curve or single-point analytical models.
See Also
Reference
AnalyticalModelSelector Class
AnalyticalModelSelector Overload
Autodesk.Revit.DB.Structure Namespace